#---------------------------------随机种子设置-----------------------------------------
seed=2025
#--------------------------------几何模型设置-----------------------------------------
#--------Length：x方向的长度，Width：y方向的长度，Height：z方向的长度---------------
Length=4.0
Width=1.0
Height=1.0
#--------Nx：x方向的节点数，Ny：y方向的节点数，Nz：z方向的节点数---------------
Nx=40
Ny=10
Nz=10
#-------------------------------材料参数设置-------------------------------------
# ----------E：杨氏模量，nu：泊松比---------------
E=1000
nu=0.3
#-------------------------------Dirichlet边界条件设置-------------------------------------
# ----------Dir_marker：边界标记，Dir_u：边界指定位移---------------
Dir_marker=0.0
Dir_u=[0.0, 0.0, 0.0]
#-------------------------------Neumann边界条件设置-------------------------------------
# ----------Neu_marker：边界标记，Neu_t：边界指定力---------------
Neu_marker=4.0
Neu_t=[0.0, -5.0, 0.0]

#--------------------------------神经网络设置-----------------------------------------
input_size=3  # ResNet的输入大小
hidden_size=64  # ResNet的隐藏层大小
output_size=3  # ResNet的输出大小
depth=4  # ResNet的深度
#--------------------------------训练参数设置-----------------------------------------
epoch_num=120  # 训练的epoch数
beta=0.5 # AdamW和LBFGS的切换参数
learning_rate_AdamW=0.005  #  AdamW的学习率
learning_rate_LBFGS=0.2  # LBFGS的学习率
max_iter_LBFGS=20  # LBFGS的最大迭代次数
#---------------------------结果保存路径-----------------------------------------------
model_save_path=f"DEM3D/Results/mesh{Nx}x{Ny}x{Nz}"
Evaluate_save_path=f"DEM3D/Results/mesh{Nx}x{Ny}x{Nz}/NeoHook_{depth}Layer_mesh{Nx*Ny*Nz}_iter{epoch_num}_lr{learning_rate_LBFGS}_mont"