#---------------------------------随机种子-----------------------------------------
seed = 2025
#---------------------------------网格设置-----------------------------------------
mesh_points=4245  # 网格点数

#--------------------------------高斯积分精度设置-----------------------------------------
n_int3D=2  # 三维高斯积分精度
n_int2D=2  # 二维高斯积分精度

#-------------------------------材料参数设置-------------------------------------
# ----------E：杨氏模量，nu：泊松比---------------
E=1000
nu=0.3
#-------------------------------Dirichlet边界条件设置-------------------------------------
# ----------Dir_marker：边界标记，Dir_u：边界指定位移---------------
Dir_u=[0.0, 0.0, 0.0]
#-------------------------------Neumann边界条件设置-------------------------------------
# ----------Neu_marker：边界标记，Neu_t：边界指定力---------------
Neu_t=[0.0, -5.0, 0.0]

#--------------------------------神经网络设置-----------------------------------------
input_size=3  # ResNet的输入大小
hidden_size=64  # ResNet的隐藏层大小
output_size=3  # ResNet的输出大小
depth=4  # ResNet的深度
#--------------------------------训练参数设置-----------------------------------------
epoch_num=40  # 训练的epoch数
learning_rate_AdamW=0.005  #  AdamW的学习率
learning_rate_LBFGS=0.2  # LBFGS的学习率
max_iter_LBFGS=20  # LBFGS的最大迭代次数

#---------------------------文件路径-----------------------------------------------
mesh_path=f"Beam3D/mesh/beam_mesh_{mesh_points}.msh"
model_save_path=f"Beam3D/Results/mesh{mesh_points}/int{n_int3D}"
Evaluate_save_path=f"Beam3D/Results/mesh{mesh_points}/int{n_int3D}/NeoHook_{depth}Layer_gmsh{mesh_points}_iter{epoch_num}_lr{learning_rate_LBFGS}_int{n_int3D}"